grevaillot/svd_tools/headers/STM32G441xx/tim4.h
#pragma once 

/* --- TIM4: Advanced-timers ---------------------------------------- */

/** @defgroup tim4_registers Advanced-timers Register
@{*/

/** TIM4_CR1 control register 1 **/
#define TIM4_CR1			MMIO32(TIM4_BASE + 0x00)
/** TIM4_CR2 control register 2 **/
#define TIM4_CR2			MMIO32(TIM4_BASE + 0x04)
/** TIM4_SMCR slave mode control register **/
#define TIM4_SMCR			MMIO32(TIM4_BASE + 0x08)
/** TIM4_DIER DMA/Interrupt enable register **/
#define TIM4_DIER			MMIO32(TIM4_BASE + 0x0c)
/** TIM4_SR status register **/
#define TIM4_SR			MMIO32(TIM4_BASE + 0x10)
/** TIM4_EGR event generation register **/
#define TIM4_EGR			MMIO32(TIM4_BASE + 0x14)
/** TIM4_CCMR1_Output capture/compare mode register 1 (output mode) **/
#define TIM4_CCMR1_Output			MMIO32(TIM4_BASE + 0x18)
/** TIM4_CCMR1_Input capture/compare mode register 1 (input mode) **/
#define TIM4_CCMR1_Input			MMIO32(TIM4_BASE + 0x18)
/** TIM4_CCMR2_Output capture/compare mode register 2 (output mode) **/
#define TIM4_CCMR2_Output			MMIO32(TIM4_BASE + 0x1c)
/** TIM4_CCMR2_Input capture/compare mode register 2 (input mode) **/
#define TIM4_CCMR2_Input			MMIO32(TIM4_BASE + 0x1c)
/** TIM4_CCER capture/compare enable register **/
#define TIM4_CCER			MMIO32(TIM4_BASE + 0x20)
/** TIM4_CNT counter **/
#define TIM4_CNT			MMIO32(TIM4_BASE + 0x24)
/** TIM4_PSC prescaler **/
#define TIM4_PSC			MMIO32(TIM4_BASE + 0x28)
/** TIM4_ARR auto-reload register **/
#define TIM4_ARR			MMIO32(TIM4_BASE + 0x2c)
/** TIM4_RCR repetition counter register **/
#define TIM4_RCR			MMIO32(TIM4_BASE + 0x30)
/** TIM4_CCR1 capture/compare register 1 **/
#define TIM4_CCR1			MMIO32(TIM4_BASE + 0x34)
/** TIM4_CCR2 capture/compare register 2 **/
#define TIM4_CCR2			MMIO32(TIM4_BASE + 0x38)
/** TIM4_CCR3 capture/compare register 3 **/
#define TIM4_CCR3			MMIO32(TIM4_BASE + 0x3c)
/** TIM4_CCR4 capture/compare register 4 **/
#define TIM4_CCR4			MMIO32(TIM4_BASE + 0x40)
/** TIM4_BDTR break and dead-time register **/
#define TIM4_BDTR			MMIO32(TIM4_BASE + 0x44)
/** TIM4_CCR5 capture/compare register 4 **/
#define TIM4_CCR5			MMIO32(TIM4_BASE + 0x48)
/** TIM4_CCR6 capture/compare register 4 **/
#define TIM4_CCR6			MMIO32(TIM4_BASE + 0x4c)
/** TIM4_CCMR3_Output capture/compare mode register 2 (output mode) **/
#define TIM4_CCMR3_Output			MMIO32(TIM4_BASE + 0x50)
/** TIM4_DTR2 timer Deadtime Register 2 **/
#define TIM4_DTR2			MMIO32(TIM4_BASE + 0x54)
/** TIM4_ECR DMA control register **/
#define TIM4_ECR			MMIO32(TIM4_BASE + 0x58)
/** TIM4_TISEL TIM timer input selection register **/
#define TIM4_TISEL			MMIO32(TIM4_BASE + 0x5c)
/** TIM4_AF1 TIM alternate function option register 1 **/
#define TIM4_AF1			MMIO32(TIM4_BASE + 0x60)
/** TIM4_AF2 TIM alternate function option register 2 **/
#define TIM4_AF2			MMIO32(TIM4_BASE + 0x64)
/** TIM4_DCR control register **/
#define TIM4_DCR			MMIO32(TIM4_BASE + 0x3dc)
/** TIM4_DMAR DMA address for full transfer **/
#define TIM4_DMAR			MMIO32(TIM4_BASE + 0x3e0)

/**@}*/


/** @defgroup tim4_cr1 CR1 control register 1
@{*/

/** TIM4_CR1_DITHEN Dithering Enable **/
#define TIM4_CR1_DITHEN		(1 << 12)
/** TIM4_CR1_UIFREMAP UIF status bit remapping **/
#define TIM4_CR1_UIFREMAP		(1 << 11)

#define TIM4_CR1_CKD_SHIFT		8
#define TIM4_CR1_CKD_MASK		0x03
/** @defgroup tim4_cr1_ckd CKD Clock division
@{*/
/**@}*/

/** TIM4_CR1_ARPE Auto-reload preload enable **/
#define TIM4_CR1_ARPE		(1 << 7)

#define TIM4_CR1_CMS_SHIFT		5
#define TIM4_CR1_CMS_MASK		0x03
/** @defgroup tim4_cr1_cms CMS Center-aligned mode selection
@{*/
/**@}*/

/** TIM4_CR1_DIR Direction **/
#define TIM4_CR1_DIR		(1 << 4)
/** TIM4_CR1_OPM One-pulse mode **/
#define TIM4_CR1_OPM		(1 << 3)
/** TIM4_CR1_URS Update request source **/
#define TIM4_CR1_URS		(1 << 2)
/** TIM4_CR1_UDIS Update disable **/
#define TIM4_CR1_UDIS		(1 << 1)
/** TIM4_CR1_CEN Counter enable **/
#define TIM4_CR1_CEN		(1 << 0)

/**@}*/

/** @defgroup tim4_cr2 CR2 control register 2
@{*/

/** TIM4_CR2_MMS_3 Master mode selection - bit 3 **/
#define TIM4_CR2_MMS_3		(1 << 25)

#define TIM4_CR2_MMS2_SHIFT		20
#define TIM4_CR2_MMS2_MASK		0x0f
/** @defgroup tim4_cr2_mms2 MMS2 Master mode selection 2
@{*/
/**@}*/

/** TIM4_CR2_OIS6 Output Idle state 6 (OC6 output) **/
#define TIM4_CR2_OIS6		(1 << 18)
/** TIM4_CR2_OIS5 Output Idle state 5 (OC5 output) **/
#define TIM4_CR2_OIS5		(1 << 16)
/** TIM4_CR2_OIS4N Output Idle state 4 (OC4N output) **/
#define TIM4_CR2_OIS4N		(1 << 15)
/** TIM4_CR2_OIS4 Output Idle state 4 **/
#define TIM4_CR2_OIS4		(1 << 14)
/** TIM4_CR2_OIS3N Output Idle state 3 **/
#define TIM4_CR2_OIS3N		(1 << 13)
/** TIM4_CR2_OIS3 Output Idle state 3 **/
#define TIM4_CR2_OIS3		(1 << 12)
/** TIM4_CR2_OIS2N Output Idle state 2 **/
#define TIM4_CR2_OIS2N		(1 << 11)
/** TIM4_CR2_OIS2 Output Idle state 2 **/
#define TIM4_CR2_OIS2		(1 << 10)
/** TIM4_CR2_OIS1N Output Idle state 1 **/
#define TIM4_CR2_OIS1N		(1 << 9)
/** TIM4_CR2_OIS1 Output Idle state 1 **/
#define TIM4_CR2_OIS1		(1 << 8)
/** TIM4_CR2_TI1S TI1 selection **/
#define TIM4_CR2_TI1S		(1 << 7)

#define TIM4_CR2_MMS_SHIFT		4
#define TIM4_CR2_MMS_MASK		0x07
/** @defgroup tim4_cr2_mms MMS Master mode selection
@{*/
/**@}*/

/** TIM4_CR2_CCDS Capture/compare DMA selection **/
#define TIM4_CR2_CCDS		(1 << 3)
/** TIM4_CR2_CCUS Capture/compare control update selection **/
#define TIM4_CR2_CCUS		(1 << 2)
/** TIM4_CR2_CCPC Capture/compare preloaded control **/
#define TIM4_CR2_CCPC		(1 << 0)

/**@}*/

/** @defgroup tim4_smcr SMCR slave mode control register
@{*/

/** TIM4_SMCR_SMSPS SMS Preload Source **/
#define TIM4_SMCR_SMSPS		(1 << 25)
/** TIM4_SMCR_SMSPE SMS Preload Enable **/
#define TIM4_SMCR_SMSPE		(1 << 24)

#define TIM4_SMCR_TS_4_3_SHIFT		20
#define TIM4_SMCR_TS_4_3_MASK		0x03
/** @defgroup tim4_smcr_ts_4_3 TS43 Trigger selection - bit 4:3
@{*/
/**@}*/

/** TIM4_SMCR_SMS_3 Slave mode selection - bit 3 **/
#define TIM4_SMCR_SMS_3		(1 << 16)
/** TIM4_SMCR_ETP External trigger polarity **/
#define TIM4_SMCR_ETP		(1 << 15)
/** TIM4_SMCR_ECE External clock enable **/
#define TIM4_SMCR_ECE		(1 << 14)

#define TIM4_SMCR_ETPS_SHIFT		12
#define TIM4_SMCR_ETPS_MASK		0x03
/** @defgroup tim4_smcr_etps ETPS External trigger prescaler
@{*/
/**@}*/


